---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.CurveByPointFailures
source: html/f9b4f4f2-5eb9-62c0-edcc-b3807ee3f2a6.htm
---
# BuiltInFailures.CurveByPointFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.